{"meta":{"title":"eshenhu's blog","subtitle":null,"description":"It never be later than do nothing","author":"eshenhu","url":"https://eshenhu.github.io"},"pages":[],"posts":[{"title":"Drgon ball release their code to explain the reason, cool","slug":"Drgon-ball-release-their-code-to-explain-the-reason-cool","date":"2018-11-01T15:17:32.000Z","updated":"2018-11-06T15:24:42.000Z","comments":true,"path":"2018/11/01/Drgon-ball-release-their-code-to-explain-the-reason-cool/","link":"","permalink":"https://eshenhu.github.io/2018/11/01/Drgon-ball-release-their-code-to-explain-the-reason-cool/","excerpt":"Today, I was surffing the web and saw a very interesting story about the players suspected the Drogon Ball game maker cheat on the game here and here Dragon Ball finally release their code to explain the reason, which is really HACKER way. I like it. In now days, as a player, youneed not only the crack skills as before, but also some basic code skills. :-) About the problem: In the game application “ Dragon Ball Z Dokkan Battle “ there was a typographical mistake in some gacha and the influence \\”There might have been a character that does not appear for each user (whether there was a wrong setting)” According to the problem being said, the management side explained “by mistake of notation”. However, the source code has been released this time whether the riot did not fit.","text":"Today, I was surffing the web and saw a very interesting story about the players suspected the Drogon Ball game maker cheat on the game here and here Dragon Ball finally release their code to explain the reason, which is really HACKER way. I like it. In now days, as a player, youneed not only the crack skills as before, but also some basic code skills. :-) About the problem: In the game application “ Dragon Ball Z Dokkan Battle “ there was a typographical mistake in some gacha and the influence \\”There might have been a character that does not appear for each user (whether there was a wrong setting)” According to the problem being said, the management side explained “by mistake of notation”. However, the source code has been released this time whether the riot did not fit. Some points were here: Dragon Ball partly use C++ 11 as their back-end system. Dragon Ball use cache system to cache the CardId for players. If cache was missed, then the function will lookup the data in back-end Sqlite. The return value result will RVO(Return Value Opti) by the compiler, so no copy will happened between caller and callee. The problem caused by the Sql query and following handling branch. Beside the logical error, some improvements could be: Line 3 and Line 4 can be optimized in one line during constructor, it will be better if 1vector&lt;CardDataPtr&gt; result(masterCardIds.size()); All the self-incremental operation can be optimized by “++i” instead of “i++”. I am thinking the number of players will be dynamic changed, f.g. in the weekend or the evening, the player will be more than normal, assume cache system use LRU to do update, if the cache was not quite config well, f.g. the size was config with a relative small value comparing with number of players, it means this function will mostly lookup the value to the sqlite, Sqlite will be busy during this time, in some worse-case scenario, it will dramaticlly decrease the performance of the system. So, the cache system should know about this, increase the capacity to cache more data than normal, it means it was needed to emit a performance counter data to the monitor system between the block 1 and block 2 in the picture to tell how frequency of Query request for CardData, later system tuning will be considered if some system bottleneck was happened. Finally, I like the working way of Dragon Ball exposing the problem. It is cool.","categories":[],"tags":[]},{"title":"Write a HW based periodic timer framework","slug":"Write-a-HW-based-periodic-timer-framework","date":"2018-08-12T08:12:00.000Z","updated":"2018-08-12T08:17:38.000Z","comments":true,"path":"2018/08/12/Write-a-HW-based-periodic-timer-framework/","link":"","permalink":"https://eshenhu.github.io/2018/08/12/Write-a-HW-based-periodic-timer-framework/","excerpt":"Introduction Linux kernel provided good readable timer operations in the code. ref timer Some attributes of system timer in the kernel are: 1) It was not designed for time-critical kernel modules, as it takes much works during the tick, such like update jiffies, process accounting, RCU callback, _irq_work_etc. 2) Some throughput cared system was configed in the kernel configration with “NOHZ” option, Invoke the tick during the “IDLE” state will offset the impact of the kernel “NOHZ” configration. We just want to invoke the callback instead of wake up other staffs. 3) Nearly all the embedded SoC have their design with 2 or more counter-based HW timers, it was not wise design binding the periodic work to the system timer.","text":"Introduction Linux kernel provided good readable timer operations in the code. ref timer Some attributes of system timer in the kernel are: 1) It was not designed for time-critical kernel modules, as it takes much works during the tick, such like update jiffies, process accounting, RCU callback, _irq_work_etc. 2) Some throughput cared system was configed in the kernel configration with “NOHZ” option, Invoke the tick during the “IDLE” state will offset the impact of the kernel “NOHZ” configration. We just want to invoke the callback instead of wake up other staffs. 3) Nearly all the embedded SoC have their design with 2 or more counter-based HW timers, it was not wise design binding the periodic work to the system timer. Write a simple Periodic-Timer-Service for the SoC with additional HW counters.Some preconditions on this simple HW based timer framework are: The counter based HW timer can be programmed to generate the interrupt for fast handling attached events. Only periodic task was supported now. Detail design Public timer API1) periodic_task_setup(void) // called during the init stage, init the needed data structures.2) periodic_task_add(cpu, period, (*action), data, *name) // add period task into service.3) periodic_task_remove(*task)/periodic_task_remove_all() // remove task from list.4) periodic_task_get_period(*task)/periodic_task_get_cpu(*task)/periodic_task_get_name(*task) //get method5) global_timer_send_sync() //send IPI to the another SMP processor.6) global_timer_proc() // called when interrupt happened UsageIn the arch setup procedure, invoke periodic_task_setup(). Register the global_timer_proc() in timer irq handler. ImplementionI put all the code into my Github repo link","categories":[],"tags":[{"name":"Linux Kernel Module","slug":"Linux-Kernel-Module","permalink":"https://eshenhu.github.io/tags/Linux-Kernel-Module/"}]},{"title":"Use DPDK to accelerate LTE networks","slug":"Use-DPDK-to-accelerate-LTE-networks","date":"2018-05-22T10:51:28.000Z","updated":"2018-07-01T16:32:19.000Z","comments":true,"path":"2018/05/22/Use-DPDK-to-accelerate-LTE-networks/","link":"","permalink":"https://eshenhu.github.io/2018/05/22/Use-DPDK-to-accelerate-LTE-networks/","excerpt":"Along with the revolution of FlexRAN, the Tele was required to provide more flexible services to the customers. One of them is Tele want to provide more customsize services to the paticular users, such like Oil, Medical etc manufacture industries, who want intergrate more industried services within some fixed area. Both the internet Cloud companies and Tele companies want to share this market. This reqiures the tradition tele companies adaping to the fast market, utilizing their advantages to make the profits. They also want to manager the networks services in one platform to decrease the investment, f.g. In the scenario above, Tele need to deploy the traffic offloading service in the edge network for saving the time latency, or intergrate the core network services in the nearby edge LTE/5G eNodeB equipment. New platformWe cooperate with Intel to make some typical x86 platforms to make tries on these area, and make some progress on how to mano the sevices under different scenarios. Intel Atom C3K is one of our lowcost platform, we experience eNodeB/EPC network service on this platform.","text":"Along with the revolution of FlexRAN, the Tele was required to provide more flexible services to the customers. One of them is Tele want to provide more customsize services to the paticular users, such like Oil, Medical etc manufacture industries, who want intergrate more industried services within some fixed area. Both the internet Cloud companies and Tele companies want to share this market. This reqiures the tradition tele companies adaping to the fast market, utilizing their advantages to make the profits. They also want to manager the networks services in one platform to decrease the investment, f.g. In the scenario above, Tele need to deploy the traffic offloading service in the edge network for saving the time latency, or intergrate the core network services in the nearby edge LTE/5G eNodeB equipment. New platformWe cooperate with Intel to make some typical x86 platforms to make tries on these area, and make some progress on how to mano the sevices under different scenarios. Intel Atom C3K is one of our lowcost platform, we experience eNodeB/EPC network service on this platform. What/How we madeLTE network stack can be split as serveral ways, refer to the ??? from L1 PHY to the PDCP layer. In this demostration, we make LTE splict with Type 5 method, which is split from PDCP layer from traditional LTE equipement to the centrol x86 resource pool. DPDK/VPPIn the x86 platform, some tries and experience in ARM Soc platform was not quite suitable in x86, the reason include, security, complexicity and more. Security: In the x86 platform, the tele require to use private or public Cloud service in the platform, so, security is quite importanct than before. Platfrom difference. We consider use more x86 features to accelerate the platform, include the AES instruction, HW additional card, Multi-core etc. Complexity: With DPDK/VPP help, it is possible to re-think the arch of SW. How to make the software run faster. ETSI compitable. ETSI/OPNFV had already given the reference design on how to make NFV platform. ChallagesActually, as the first step, we only try to make the LTE stack run in the x86 platform. some challages includes: Make the advantage of multi-core platform. Run to Complete or Service Chains Compute mode. How to manage or compose serives chains? Use DPDK membuf to rewrite the existed internal structure. … We made some tries on this challages: Fully use both run-to-complete mode and service chains.f.g. PDCP layer is an instructin intensity unit, which do the ROHC/Header compression, etc work, in addtion it was sensitive to the latency. We isolate the 2 cores to the PDCP layers, internally vertical split the PDCP work into different services. Limit the CPU/Memory resource to the servicesGood citizens is important to the robustness of the platform. Use cgroups to limit such resources to each services. Use mempool to manage our internal memory structure.","categories":[],"tags":[]},{"title":"build lightweight network monitor tools","slug":"build-lightweight-network-monitor-tools","date":"2018-05-16T15:14:19.000Z","updated":"2018-06-11T14:25:54.000Z","comments":true,"path":"2018/05/16/build-lightweight-network-monitor-tools/","link":"","permalink":"https://eshenhu.github.io/2018/05/16/build-lightweight-network-monitor-tools/","excerpt":"MotivationRecently my project need a lightweight network monitor tools to peek at the network activity, some basic requirements was list as following: Provide basic network/interface SDK to the application. The service need provide the report on activities on the network, like interface modification, add/del/modify including ip changes, mac changes, new interface added, etc network connectiong status, stale/reachable Extensibility and decouple serive and client, easy to intergrate other service. Lightweight, less CPU usage and memory usage. After google some open source projects, I found it seems like no one can fit my requirement, but the iproute2 project was quite fit my requirement. So, why we don’t make iproute2 as a library? I list the Pros and Cons if use iproute2 as library: Pros: No need to write the socket layer code. More or even more information about network interfaces can be got. Same functionality with the iproute2 tools. Simple API interface. Cons: iproute2-as-lib library size is big. ~500kb. GitHub: iprout2_as_lib Enjoy it!","text":"MotivationRecently my project need a lightweight network monitor tools to peek at the network activity, some basic requirements was list as following: Provide basic network/interface SDK to the application. The service need provide the report on activities on the network, like interface modification, add/del/modify including ip changes, mac changes, new interface added, etc network connectiong status, stale/reachable Extensibility and decouple serive and client, easy to intergrate other service. Lightweight, less CPU usage and memory usage. After google some open source projects, I found it seems like no one can fit my requirement, but the iproute2 project was quite fit my requirement. So, why we don’t make iproute2 as a library? I list the Pros and Cons if use iproute2 as library: Pros: No need to write the socket layer code. More or even more information about network interfaces can be got. Same functionality with the iproute2 tools. Simple API interface. Cons: iproute2-as-lib library size is big. ~500kb. GitHub: iprout2_as_lib Enjoy it!","categories":[],"tags":[]},{"title":"Build your private LTE network for IIOT","slug":"Build-your-private-LTE-network-for-IIOT","date":"2017-12-28T09:15:55.000Z","updated":"2018-02-25T09:34:31.000Z","comments":true,"path":"2017/12/28/Build-your-private-LTE-network-for-IIOT/","link":"","permalink":"https://eshenhu.github.io/2017/12/28/Build-your-private-LTE-network-for-IIOT/","excerpt":"Abstract: In some specfied conditions, the tele operator is considering share/reserve some spectrum resource to the IIOT(Industry IoT)applicance, like the NB-IoT/eMTC tech defined by 3GPP stardard.In this article, we present a solution on how to offload LTE with Selected IP tracffic offload(SIPTO) tech, which provide another practical solution beside the traditional LTE macro cell deployment. This deployment will save the investment and simplify the Network Element deloyment, as well as increase the KPI in local factory. Keywords: SIPTO, LIPA, IMobile Data Offloading IntroductionWith the increase of cost spent in thse back-haul equipment(either in the urban area or in the low-intensity population area), more and more operator will like consider using the existed cable provider (like Comcast in US) as their back-haul alternatively. Specially FTTH and other PON technology become more and more popular, cable operator can provide relatively high QoS now. 3GPP present the TS23.829 as the guide to the HeNB manufacture how to deploy the off-load infrastructure cooperating with the macro cell to reach the best experience to the end-user. Along with the population of Industry 4.0 and edge-computing, more and more geography-fixed device has the requirement to access the network with QoS and throughput. Specially in the smart-factory setup, they want to rent the telcomm wireless network within their factory-domain or running their owned private wireless network.Specially, the vCPEs in the same eNodeB want to intercommunicate to each other, which means the traffic happened between those vCPEs will not route outside of local domain. for example, in the steaming video like IPTV services in the set-top box, each app was used with P2P technology, locate gateway offloading and vCPEs interconnection each other is a big cons to the end-user’s experience.In some industry area, the end sensors, robots or equipments will generate huge data per day, the factory owner will be careful to consider use, like LTE network as their connecting method. even most of data will not access outside of factory.With this kind of deloyment, the operator will reduce stress on the network and make better profit on the IIoT revolution. As a summary, some characters were: SON (automatically select the proper wireless configuration) Traffic local Gateway offloading. vCPE inter accessibility in the eNodeBs managed by a same LGW.","text":"Abstract: In some specfied conditions, the tele operator is considering share/reserve some spectrum resource to the IIOT(Industry IoT)applicance, like the NB-IoT/eMTC tech defined by 3GPP stardard.In this article, we present a solution on how to offload LTE with Selected IP tracffic offload(SIPTO) tech, which provide another practical solution beside the traditional LTE macro cell deployment. This deployment will save the investment and simplify the Network Element deloyment, as well as increase the KPI in local factory. Keywords: SIPTO, LIPA, IMobile Data Offloading IntroductionWith the increase of cost spent in thse back-haul equipment(either in the urban area or in the low-intensity population area), more and more operator will like consider using the existed cable provider (like Comcast in US) as their back-haul alternatively. Specially FTTH and other PON technology become more and more popular, cable operator can provide relatively high QoS now. 3GPP present the TS23.829 as the guide to the HeNB manufacture how to deploy the off-load infrastructure cooperating with the macro cell to reach the best experience to the end-user. Along with the population of Industry 4.0 and edge-computing, more and more geography-fixed device has the requirement to access the network with QoS and throughput. Specially in the smart-factory setup, they want to rent the telcomm wireless network within their factory-domain or running their owned private wireless network.Specially, the vCPEs in the same eNodeB want to intercommunicate to each other, which means the traffic happened between those vCPEs will not route outside of local domain. for example, in the steaming video like IPTV services in the set-top box, each app was used with P2P technology, locate gateway offloading and vCPEs interconnection each other is a big cons to the end-user’s experience.In some industry area, the end sensors, robots or equipments will generate huge data per day, the factory owner will be careful to consider use, like LTE network as their connecting method. even most of data will not access outside of factory.With this kind of deloyment, the operator will reduce stress on the network and make better profit on the IIoT revolution. As a summary, some characters were: SON (automatically select the proper wireless configuration) Traffic local Gateway offloading. vCPE inter accessibility in the eNodeBs managed by a same LGW. L-GW An dedicated APN was assigned to vCPEs to indicate that the PDN connection established through this APN in the classic scenario, All the traffics associated with this PDN connection will be offloaded. All the equipment under this cell/eNode will be assigned the IP address with the pre-defined pattern which require the private IP range reserved by INNNA. L-GW will use NAT to masquerade those equipment. Local Traffic offload and optimizingL-GW will be responsible to forward/route ip package, if traffic offload procedure was decided, the HeNB will directly forward the IP frame to the L-GW instead of GTP-U frame. VxLAN supportIn some factories, the end sensor/robots need peer-to-peer communication, which require the end device support the VxLAN, then all the sensors can be splited/planned in more flexible way. Design detailsBenchmark comparsionCustomer Use Case","categories":[],"tags":[{"name":"SIPTO LIPA IMobile Data Offloading","slug":"SIPTO-LIPA-IMobile-Data-Offloading","permalink":"https://eshenhu.github.io/tags/SIPTO-LIPA-IMobile-Data-Offloading/"}]},{"title":"Build service with SOA in Openwrt","slug":"Build-service-with-SOA-in-Openwrt","date":"2017-11-22T10:51:28.000Z","updated":"2017-12-22T00:57:46.000Z","comments":true,"path":"2017/11/22/Build-service-with-SOA-in-Openwrt/","link":"","permalink":"https://eshenhu.github.io/2017/11/22/Build-service-with-SOA-in-Openwrt/","excerpt":"In one of internal technical review meeting, the coder integrate the service into a existed substance/service, but considering of the scalability of this service, I strongly recommended the developer decouple this service from any substance and made them into a self-contained substance in order to provide the service to more clients in the future. ##SOA in practice In the wikipedia page, SOA was needed to meet the following basic rules. A service has four properties according to one of many definitions of SOA: It logically represents a business activity with a specified outcome. It is self-contained. It is a black box for its consumers. It may consist of other underlying services. In the resource-limited SoC, it maybe not practical to deploy individual service with one standalone process, but it will be possible deploying partly/all services in one process and multiplexed the service using the different domain/interface id.","text":"In one of internal technical review meeting, the coder integrate the service into a existed substance/service, but considering of the scalability of this service, I strongly recommended the developer decouple this service from any substance and made them into a self-contained substance in order to provide the service to more clients in the future. ##SOA in practice In the wikipedia page, SOA was needed to meet the following basic rules. A service has four properties according to one of many definitions of SOA: It logically represents a business activity with a specified outcome. It is self-contained. It is a black box for its consumers. It may consist of other underlying services. In the resource-limited SoC, it maybe not practical to deploy individual service with one standalone process, but it will be possible deploying partly/all services in one process and multiplexed the service using the different domain/interface id. ubus in Openwrtubus is an daemon process for other process/daemons to register themselfs as well as sending messages. The interface is implemented using Unix sockets and use TLV(type-length-value) messages. Just for example: By default, list all namespaces registered with the RPC server:1234567root@uplink:~# ubus listnetworknetwork.devicenetwork.interface.lannetwork.interface.loopbacknetwork.interface.wanroot@uplink:~# If invoked with -v, the procedures and their argument signatures are dumped in addition to the namespace path:123456789101112root@uplink:~# ubus -v list network.interface.lan&apos;network.interface.lan&apos; @099f0c8b &quot;up&quot;: &#123; &#125; &quot;down&quot;: &#123; &#125; &quot;status&quot;: &#123; &#125; &quot;prepare&quot;: &#123; &#125; &quot;add_device&quot;: &#123; &quot;name&quot;: &quot;String&quot; &#125; &quot;remove_device&quot;: &#123; &quot;name&quot;: &quot;String&quot; &#125; &quot;notify_proto&quot;: &#123; &#125; &quot;remove&quot;: &#123; &#125; &quot;set_data&quot;: &#123; &#125;root@uplink:~# Besides, ubusd define others message handlers as followings:123456789101112static const ubus_cmd_cb handlers[__UBUS_MSG_LAST] = &#123; [UBUS_MSG_PING] = ubusd_send_pong, [UBUS_MSG_ADD_OBJECT] = ubusd_handle_add_object, [UBUS_MSG_REMOVE_OBJECT] = ubusd_handle_remove_object, [UBUS_MSG_LOOKUP] = ubusd_handle_lookup, [UBUS_MSG_INVOKE] = ubusd_handle_invoke, [UBUS_MSG_STATUS] = ubusd_handle_response, [UBUS_MSG_DATA] = ubusd_handle_response, [UBUS_MSG_SUBSCRIBE] = ubusd_handle_add_watch, [UBUS_MSG_UNSUBSCRIBE] = ubusd_handle_remove_watch, [UBUS_MSG_NOTIFY] = ubusd_handle_notify, &#125;; how ubus worksThe following picture demonstrate the interactive between ubus client 1 and ubus client 2.ubus client 1 register two namespace towards ubusd. In the namespace interface, there are 2 methods getlanip and setlanip for accepting the external actions. The client can notify all the subscribed clients if the proper event in client need to broadcast. PracticeLicense service is a service which provide license information like “what licenses was installed? what capacity did one specified license have?”, and if the license was expired, licenseservice need notify this change to the client, as well as when new license was added.In summary, License service need provide such kinds of services: Get: Service is ready or not. Client can query detailed information on one/several license(s). Set: Add/Remove a license file. Notify: Notify all the registed client(s) about the changes. During the booting time, coordinator need to start the service firstly, and confirm it’s status is READY, then booting other substances. Each substance need register themselves to the service, some substances only get the license info which they care about, and ready to receive the changes on these licenses. ##ENDIt seems like ubus can’t good support the multi-thread environment, after checking the source code, it was found that it use some global variable to store the value. It need to be re-constructed if used in the multi-thread env.","categories":[],"tags":[]},{"title":"Design a license system in embedded system","slug":"Design-a-license-system-in-embedded-system","date":"2017-11-02T10:14:55.000Z","updated":"2017-12-22T00:27:12.000Z","comments":true,"path":"2017/11/02/Design-a-license-system-in-embedded-system/","link":"","permalink":"https://eshenhu.github.io/2017/11/02/Design-a-license-system-in-embedded-system/","excerpt":"License was widely used on many software/hardware area, such as Microsoft Windows Series, which use dedicated hardware to store their key and other information to verify the booting OS is legal or not. Dell or EMC or Oracle Database use license to limit how many HW resource can be used. So, license system is an valuable assert to the company as it can bring the direct profit. Aspects when designing license system Security Compatible BackgroundIn common, the company would like to design a universal HW platform to carry on different requirements with the reason of decreasing the complex of BOM, leverage the cost on HW expense, etc. In order to make more profit on a universal hardware platform, then you need a license system to give the right authority to your sales/customer. For example, in the wireless system, some company would like sale the HW without any charge or very low price, but those HW only can carry on low volume data/service in the BASIC state, f.g. LTE station in BASIC mode only can take 16 Users in one BST, a limited throughput, a limited Cells can be setup. Basically, you had to buy a suitable license paper meeting your requirement, just like the menu in the restaurant, you can’t image how many menus did the company make ready for you.In one word, License can make money!!!","text":"License was widely used on many software/hardware area, such as Microsoft Windows Series, which use dedicated hardware to store their key and other information to verify the booting OS is legal or not. Dell or EMC or Oracle Database use license to limit how many HW resource can be used. So, license system is an valuable assert to the company as it can bring the direct profit. Aspects when designing license system Security Compatible BackgroundIn common, the company would like to design a universal HW platform to carry on different requirements with the reason of decreasing the complex of BOM, leverage the cost on HW expense, etc. In order to make more profit on a universal hardware platform, then you need a license system to give the right authority to your sales/customer. For example, in the wireless system, some company would like sale the HW without any charge or very low price, but those HW only can carry on low volume data/service in the BASIC state, f.g. LTE station in BASIC mode only can take 16 Users in one BST, a limited throughput, a limited Cells can be setup. Basically, you had to buy a suitable license paper meeting your requirement, just like the menu in the restaurant, you can’t image how many menus did the company make ready for you.In one word, License can make money!!! License file structureI suppose the company had already made through on what functionality can be made into license, then a license list need to be properly designed with readable language and description.XML will be the good choice to record such list. Some necessary element in this XML should include: License Name License Number (unique number among the license) License Signed Date (2017-10-05) License period of validity (2017-10-05 — 2018-10-05) License specify contents (this will be specified according to each license with nested XML representation) Encrypted signed message using the PK(private key) to protect the integrity and security of license message Store the public keyARM based SoC provide TrustZone tech to the end-user, It use hardware-based hypervisor to run two VMs in one SoC. The software running in the TrustZone protected zone was only allowed by the release company, which means any software which want to run in TrustZone area must get signed by the SoC company.Technically, the TrustZone is the more safe method to store the key and other security information, even in the Motorola smartphone, the cracker success bypassing the protection of the TrustZone link The latest HuaWei smartphone claim they can replace the hardware token released by the BANK in their device when do some money transition, they all use TrustZone tech. The latest Qualcomm use their own property SPC instead of ARM trustzone to store such security information.But it will be BIG for us if we only want to store a key or some unique number on the SoC using TrustZone as there are no requirement that the app running in the SoC need or less need to store their per-app key into system.As an alternative, In most SoC, there is an OTP(on-time-programming) area in the system, many SoC has such kind of area in their design, such as efuse area in Intel platform, qfuse area in Qualcomm platform, even some FLASH manufacture (Macro) make some area for such usage, but if some old device or the latest device which don’t consider such requirement in advance don’t have any such kind area with such attribute, how to handle such issues?My suggestion is use one series of non-modifiable code (make some confusion work on this code) (unique ID include your CPU ID, etc)to sign your public key file, this method can protect you in some certain range. The whole procedure will be like: Manage the private keyAs time intensity, I select the Vault to manage the private key, and wrote the back-end license generating tools using Go. We define the 2 different role on managing/using the private key. Administrator (who can generate the new pair key and revoke the key) Operator(who can use the back-end tools to generate the license key)As the Operator has no authority to see the private key, then it guarantee the security on generating the license file. ConclusionActually, the cracker still has many path to crack this license system, like searching the public API nm string in the binary code and do the binary translate work or code injection, modifying the contents if you put some sensitive contents into fixed address in ram. etc. So, it need programmer know some basic knowledge when they work on the sensitive information, don’t store such information in fixed address area, try to use stack or do some confusion work on such information. It is better read/care the latest security information released in the public, and make your defend with much consideration. ##–ContinuedFinally, after some discussion with other guys working in Standard Organization, they recommended to fully meet the requirement of the 3GPP TS133.320.This specification defines a Trusted Environment(TrE) to perform sensitive functions and store sensitive data. This data must be unknowable to unauthorized entities.Some requirements follows: The TrE must be built from a hardware root of trust. The Integrity of the TrE must be verified during the boot process. The TrE must verify the integrity of the rest of the system software. The TrE must perform the required sensitive functions to validate the device and device integrity. The TrE must perform the required sensitive functions to authenticate the device with the operator network. … So, if we fully support this standard, then we need the help of the TrustZone, where we build the TrE for the eNodeB. The HNB’s identity (SN) shall be stored in the TrE and shall not be modifiable. (it was wrote during the production with a stardard) The HNB’s private key shall be stored in the TrE and shall not be exposed outside of the TrE. (private key was used on such like IPSEC procedure) The root certificate used to verify the signatures on the SeGW certificate shall be stored in the TrE and shall be writable by authorized access only. The verification process for signatures shall be performed by the HNB’s TrE. (this related to the revoking work) The HNB’s TrE shall be used to compute the AUTH payload used during the IKE_AUTH request message exchanges. We are now evaluating the OP-TEE in our product, I will make another blog on this work. Here is a good representation on the OP-TEE.","categories":[],"tags":[]},{"title":"Fast logging system in embedded system","slug":"Fast-logging-system-in-embedded-system","date":"2017-10-23T13:04:42.000Z","updated":"2017-11-23T13:23:38.000Z","comments":true,"path":"2017/10/23/Fast-logging-system-in-embedded-system/","link":"","permalink":"https://eshenhu.github.io/2017/10/23/Fast-logging-system-in-embedded-system/","excerpt":"Fast logging system in embedded system [TOC] IntroductionFLOG is a light-weight logging system which has features like, high throughput, non-blocking and lock-less write from different process, crash save in field. It is suitable for the embedded system using Linux system. Log VS. TraceLog was used as recording the activity on subsystem, it provide the activity information to the system administrator or operator to give them a preview on the activity. such as booting information when kernel boot, plug-in-plug-out event popup by kernel. Trace was used as recording detailed information on specified system, its main purpose is used as tracking the detail into this system, the output which it generate was used by programmer to analysis what is going on when some problem happened. In common occurrence, it only be requested when system was not working as expected, such as the throughput was not reached into the theory level in wireless card, etc.","text":"Fast logging system in embedded system [TOC] IntroductionFLOG is a light-weight logging system which has features like, high throughput, non-blocking and lock-less write from different process, crash save in field. It is suitable for the embedded system using Linux system. Log VS. TraceLog was used as recording the activity on subsystem, it provide the activity information to the system administrator or operator to give them a preview on the activity. such as booting information when kernel boot, plug-in-plug-out event popup by kernel. Trace was used as recording detailed information on specified system, its main purpose is used as tracking the detail into this system, the output which it generate was used by programmer to analysis what is going on when some problem happened. In common occurrence, it only be requested when system was not working as expected, such as the throughput was not reached into the theory level in wireless card, etc. Current statusFor most products working in the embedded Linux, they always use syslogd or rsyslogd as their logging system, but actually, those daemon was designed to use as system logging such as events or activity generating from subsystem instead of recording log requiring high throughput such as tracing the detailed internal activity. What it will be happened if use them?If you use syslogd or rsyslogd as tracing work in local host, the process use them record the log via local file socket. even you redirect the log to the remote logging workstation, it use a UDP socket to send the log. If the tracing point was laid where the event happened on each per tti(1ms) kicked, then the following aspects you need to know: Though you can use un-blocking send()/sendto()/sendmsg() on socket, but sending buffer has size limit on socket (sysconf(), you can get them from /proc/net/….), once the buffer was reached this limit, the send() operation will return fail as reason of buffer was overflow or get blocked (if you config the socket properties) then it get switched by scheduler. Though syslogd will get schedule in time-slice scheduler pattern. but this daemon always work as low-priority process level with 20(nomal process level), you can reassigned this priority to a higher value, but you will get performance penalty in real-time system as nobody want a logging daemon break their performance. Then the daemon will get scheduled when user application blocked by send() operation, in that time, it need to fetch many UDP message from skb buffer and write them into file, but in the other hand, it will be unintended interrupted by other processes with higher priority than him. So, the throughput will be dramatically decreased into a low level or even lead to unstable on the whole system. In one of wireless router project, the engineer use syslogd to dump the internal operations per TTI(1ms), about 5 min later, the PHY-MAC can’t meet the minimum requirement of sync, then the whole system will down sooner. How flog aim at?FLOG, want to address the problem above, and more than that: High throughput. Non blocking logging operation (try its best). No system call penalty. Ability to be used by thread in either user-space level or kernel module. Ability to work in multi processes environment. Ability to redirect to remote machine.(not implemented now) Compatible with Syslog format. Provide far more control on filter in user space. Discard message if it had to do that. Internal design no system call, user space operationFor simplify, FLOG try its best NOT use system call for better performance.The processes running in embedded system normally get signed by the publisher, and the binary get verified by the system during booting procedure, so we think all the binary running on the embedded system are reliable and safety.With this guarantee, we create a new character device named rdev which reserved a range of space from boot args.12bootargs:root=/dev/mtdblock8 rw rootfstype=jffs2 mem=512M rram_size=8M ... Considering of the characteristic of this device named rdevwhich has no hot spot write/read from this memory, after full evaluation, this range of memory was config with no any L1/L2 cache. Then, during the booting time, we have to reserve this range of space with request_mem_region, and followed by ioremap_nocache to create the PG table for this device. Device driver accept the configurable parameter for the size of this region, 8M as the default value. A little trick was here, as normal operation, application in user space will use mmap map this region to its own space area, but it would be noisy if every process who use flog will do such job, and occupy some virtual address space for the same physical space range. For saving the memory address space in each process, the device driver of rdev reassign the PG table permission attribute with USER_ACCESS, then it means every process can directly write or read the contents with the same PG tables. As we mentioned above, security is not a problem here as we trust every process running on this system. dual ring buffer designFlog try its best not introduce any lock schematic into design as the lock will occasionally dramatic decrease the whole performance, it rather select to discard some message if too much message was flooded into the flog. Dual-Ring-Buffer design is the answer to this challenge. Multi-Log-Producer use lock-less list to update the internal structure of the working BANK, which won’t bother each other. 12345678910111213141516171819flog_write(msg)&#123; // calculate the size of writing message. int n = snprintf(NULL, 0, ...); // get the current_bank from `segment header` and check the r/w lock bit whether or not busy updated by rlog_thread. //IF YES: // Atomic switch to another bank, return back to the header in that bank; //ELSE: // return back the header in the current bank; //END current_bank = find_free_bank(); // it should consider the round-again situation, I don't express it here for simplify. atomic_set(current_bank_header, current_bank_header + align_address(n, 4)); atomic_set(message_header_rwlock); snprintf(message_header_ptr, msg, ...); atomic_clr(message_header_rwlock); //Inform daemon process if the whole size exceed the config size. F.g. 2MB flog_update_bank_write_size();&#125; elog demon process is the consumer process which dump the message in the raw into the disk, which was boot when whole system boot like syslogd. It read the configuration file under /etc/flog.conf directory. You can make it into effect with those parameters dynamically.123flog.dirty_background_ratio = 50 //50% means half message full reachedflog.dirty_interval_centisecs = 500 //msflog.rolling_file_size = 4 // Mega size flog kernel module This flog kernel module mainly change the permission of PG tables, in my init version, the flush task was assigned into the kthread started in kernel, but it has some drawbacks. multi-core deploymentMulti-core processors are more popular now, it is preferred that the flog should be deployed with different core with another where the CPU-intensive task located. The final test result show in the multi-core env, the occurrence of discarding message have a great decreased. ConclusionIn the wireless device, we often need to record the scheduler information in MAC per TTI(1ms), this requirement give us BIG challenge on the performance of logging system. Facts proves the legacy tools used for log like syslogd rsyslogd can’t meet this requirement. After a period of evaluation, this flog make impressive performance to other solution, later i will give some comparison between flog and syslogd and rsyslogd.","categories":[],"tags":[]},{"title":"system test thoughts","slug":"System-test-thoughts","date":"2017-08-16T15:33:10.000Z","updated":"2017-10-16T15:45:40.000Z","comments":true,"path":"2017/08/16/System-test-thoughts/","link":"","permalink":"https://eshenhu.github.io/2017/08/16/System-test-thoughts/","excerpt":"谈谈如何有效的测量系统负载和响应嵌入式系统在系统测试过程中往往需要进行 Stability, Robustness, Accessbility, Responsibility 等等系统测试. 以来保证系统的功能完整性和健壮性. 嵌入式系统在设计在立项阶段会给出一个设计目标, 比如一款路由器，往往会给出以下类似的要求: 支持 802.11n/g/a/b 支持. 支持 2.4G, 5G 双频. 最大速率支持 (450Mbps). … 作为系统设计者,需要在设计阶段锚定这些目标进行技术选型. 如果当前有类似产品设计经验, 可以借鉴之前的经验进行选型. 如果是第一次设计, 保守的做法便是借鉴其他厂商的方案, 等待自己对系统了解的加深和经验的丰富再进行下一阶段的开发. 无论以什么方式开局, 一个 ·能用· ·易用· ·好用· 的测试环境是必须要在第一时间阶段准备, 才能应对产品开发阶段的各项挑战. 结合我手中的几个项目, 想谈谈自己的一点关于系统测试的看法.","text":"谈谈如何有效的测量系统负载和响应嵌入式系统在系统测试过程中往往需要进行 Stability, Robustness, Accessbility, Responsibility 等等系统测试. 以来保证系统的功能完整性和健壮性. 嵌入式系统在设计在立项阶段会给出一个设计目标, 比如一款路由器，往往会给出以下类似的要求: 支持 802.11n/g/a/b 支持. 支持 2.4G, 5G 双频. 最大速率支持 (450Mbps). … 作为系统设计者,需要在设计阶段锚定这些目标进行技术选型. 如果当前有类似产品设计经验, 可以借鉴之前的经验进行选型. 如果是第一次设计, 保守的做法便是借鉴其他厂商的方案, 等待自己对系统了解的加深和经验的丰富再进行下一阶段的开发. 无论以什么方式开局, 一个 ·能用· ·易用· ·好用· 的测试环境是必须要在第一时间阶段准备, 才能应对产品开发阶段的各项挑战. 结合我手中的几个项目, 想谈谈自己的一点关于系统测试的看法. XXX 4G 路由器 此产品是利用有线宽带做接入网络,使用4G信号进行无线传输的无线设备. 设备立项阶段的设计目标为: 最大支持32用户. 上下行最高速率支持150Mbps. 支持IpSec传输. 支持Cwmp集中管理以及本地管理. 支持自开站和自优化功能. 此项目是在之前已有的平台移植进行二次开发,成立之初就发现之前单元/系统测试的极大问题. 主要暴漏在: 版本迭代过程中没有良好的回归测试覆盖. 历史版本中大量出现解决一个问题又引入新问题的commit. 系统测试没有自动化实践. 完全是靠人力进行弥补, 导致产品开发周期变长, 解决问题回溯历史时间很长. 有关系统测试的概念不清, 只关注功能实现而忽略了系统的性能. 这里只对最后一项进行一些实践说明,怎么才能提高产品的系统性能. 之前产品有系统负载的测量, 主要关注在某个系统模拟负载情况下的CPU/MEMORY的性能. 但是没有对系统的整体性能进行测量. 为什么？ 系统是一个软实时的设备,每个TTI(1ms)进行用户的调度,如果没有及时调度用户,会发生速率变低, 对时延敏感的响应降低. 所以需要在系统测试中加入不同模拟负载下用户的调度响应时间. CPU 的利用率仅仅描述了CPU一段时间的繁忙程度, 不能够反映系统的响应. 所以需要对实时的进程进行测量, 比如当前设备运行 的 MAC, PHY 实体都是对实时性要求最高的功能实体, 需要对两者之间消息处理的时间进行监控. 从用户角度出发, 需要监控从尝试接入到接入成功的时间响应, 此时间可以从另外一个维度进行系统的性能测量. 问题发现PHY STOP使用iPerf进行速率测试业务过程中,32UE情况下偶然会出现PHY STOP. 原因MAC-PHY之间有3 TTI为时间窗口作为缓冲, 如果在 3ms 之内能够同步成功, 消息既可以满足要求. 如果某个时刻未能满足这个需求, 短时间内会造成速率下降, 长时间就会出现不同步现象 PHY 就会自动 STOP. 分析使用 ftrace 分析sche info发现, MAC进程会被 IO 切换, 查看分析文件发现, MAC某处使用syslog 打印信息, syslog 默认使用本地514端口做UDP报文, 一旦超过 系统 max_tranmit_message 的容量限制, 便会成为阻塞操作, 等待 syslogd 处理消息完毕. 但是syslogd 优先级为 20的正常优先级, 即为还没有处理完socket 的内容就立刻被抢占, 导致MAC吞吐率下降. 后改为自定义的日志处理系统, 可以改善这个情况. 测试跟进CII增加MAC-PHY消息处理响应,每周版本做跟踪处理. IpSec 影响IpSec 开启后系统性能下降严重. 现象IpSec 启用后系统性能对比未使用是无论是吞吐量还是响应时间都有很大的degradation. 原因根据ftrace 打点分析, 在ipsec 同步加密数据阶段, 消耗了太多的cpu cycle. 使得系统负载升高. 解决使用硬件提供的协处理器进行硬件加解密功能, 降低CPU使用率. 使用 zero-copy 框架进行进一步优化. 测试跟进对报文在各功能实体模块之间进行打点记录,每周的系统测试记录详细数据.","categories":[],"tags":[]},{"title":"Some thoughts about memory issue","slug":"Some-thoughts-about-memory-issue","date":"2017-06-26T14:27:24.000Z","updated":"2017-06-26T15:43:14.000Z","comments":true,"path":"2017/06/26/Some-thoughts-about-memory-issue/","link":"","permalink":"https://eshenhu.github.io/2017/06/26/Some-thoughts-about-memory-issue/","excerpt":"最近一段时间在忙于内存问题的事情，算是有些成果输出吧。借机谈论一下自己的感想。 近来工程团队遇到几次比较严重的内存泄漏问题,有一些问题无疾而终.在接手工作后发现这些问题均是发生在客户的现场,很难在实验室复现. 即使能够在长时间stability测试发现问题，因为现场发生比较遥远，也是很难去定位问题. 针对此类问题,团队近期输出了几个内部产品, 较好的解决了其中的一些问题。","text":"最近一段时间在忙于内存问题的事情，算是有些成果输出吧。借机谈论一下自己的感想。 近来工程团队遇到几次比较严重的内存泄漏问题,有一些问题无疾而终.在接手工作后发现这些问题均是发生在客户的现场,很难在实验室复现. 即使能够在长时间stability测试发现问题，因为现场发生比较遥远，也是很难去定位问题. 针对此类问题,团队近期输出了几个内部产品, 较好的解决了其中的一些问题。 项目团队在 Devops team 的协助下已经有一套比较完备的测试工具, 单元测试，valgrind内存检查.但是在集成测试阶段还是缺乏手段去快速定位内存问题。针对此类问题 工程团队重构了自定义的内存分配器，加入了头尾两部分的magic number, FREE() 内存后reset内存单元内容. 在每次 ALLOC()/FREE() 强制检查合法性, 第一时间保留现场. 针对 wild pointer visit 的棘手问题的时候, 工程团队兵分两路. 一路从现有的集成测试出发，使用valgrind工具编译代码直接进入集成测试阶段进行验证.针对实时性很强的部分进行stub处理.另外一路，从系统角度，引入 dynamic memory check. 大致原理是binding 一个实时性可以调整的background线程, 使用kernel调度进行实时性内存检查, 一旦发生内存越界 magic number override 情况立刻报告. 实时性视内存问题严重性选择可调. 统计内存泄漏问题，输出了一个增强功能，主要是在内存分配阶段增加extra struct 到历史容器存储. 添加FUNCTION, LINENUMBER, 方便定位问题. 集成测试采用震荡的方式进行用例测试，放大内存泄漏问题. 使用 snapshot 功能定制差异比较. 和Devops团队合作把内存检查当作必要测试添加到robust测试用例当中. 通过工程团队的一段时间的持续改进,一些问题在后续的解决过程中得到效率的提升.","categories":[],"tags":[]},{"title":"Efficient data transfer through zero copy","slug":"Efficient-data-transfer-through-zero-copy","date":"2017-06-04T16:21:11.000Z","updated":"2017-06-11T02:43:16.000Z","comments":true,"path":"2017/06/05/Efficient-data-transfer-through-zero-copy/","link":"","permalink":"https://eshenhu.github.io/2017/06/05/Efficient-data-transfer-through-zero-copy/","excerpt":"Zero-copy I/O practice in projectRecently weeks, I was working on how to exploit the potentialities with the GMAC(1G Ethernet Media Access Controller) on the SoC in my desktop. This SoC was used in the telecommunication field which provide the fast-transfer-data capability with some interesting MAC features. In this article, I had like share some experiences on how to utilize this MAC achieving better network throughput during this work. Preface@[Blog] The following articles were worth having a look before going forward. Zero Copy I: User-Mode Perspective (from Linux Journal, strongly recommended to read) An Efficient Zero-Copy I/O Framework for UNIX (most of thoughts comes from here)","text":"Zero-copy I/O practice in projectRecently weeks, I was working on how to exploit the potentialities with the GMAC(1G Ethernet Media Access Controller) on the SoC in my desktop. This SoC was used in the telecommunication field which provide the fast-transfer-data capability with some interesting MAC features. In this article, I had like share some experiences on how to utilize this MAC achieving better network throughput during this work. Preface@[Blog] The following articles were worth having a look before going forward. Zero Copy I: User-Mode Perspective (from Linux Journal, strongly recommended to read) An Efficient Zero-Copy I/O Framework for UNIX (most of thoughts comes from here) After reading these articles, then you will know how the Java.nio.channels works. If you have more time, you can dig more on the Kafaka, the most popular message queue framework written by LinkedIn. So, let’s first look at the capability of PHY/MAC in my hand. The PHY was provided by Atheros AR8031 as Ethernet transceiver and Atheros AR8327 as Ethernet switch. Compatible with IEEE Standard 802.3. Full duplex operation 1000 Mbps operation speeds. Statistics counter registers for RMON/MIB. Embedded DMA. Only for SGMII: Integrated Physical Coding Sub-layer (PCS) with auto-negotiation. MDIO interface provided to control external phys from the Embedded RISC processor. Automatic pad and cyclic redundancy check (CRC) generation on transmitted frames. Automatic discard of frames received with errors. Receive and transmit IP, TCP and UDP checksum offload. Both IPv4 and IPv6 packet types supported. Address checking logic for four specific 48-bit addresses, four types of Ids, promiscuous mode, externaladdress checking, hash matching for unicast and multicast destination addresses and Wake-on-LAN. Programmable IPG stretch. Support for 802.1Q VLAN tagging with recognition of incoming VLAN and priority tagged frames. Support for 802.1Qbb priority-based flow control – PFC Negotiation mode. Full utilization of the Tx 1 Gbps line. Provides sufficient buffer 16KB to support lossless reception of maximum length (jumbo-type) up to 10,240Bytes Ethernet frames. For RGMII only: RGMII electrical characteristics compliant with RGMII v1.3 (thus based upon 2.5V CMOS interface voltages as defined by JEDEC EIA/JESD8-5), and are not compliant with RGMII v2.0. Support for 1588 V1/V2. Support for 802.3az Energy Efficient Ethernet Some advanced features which attract on me were: Statistics counter registers for RMON/MIB. (then we can get performance comparison on the MAC level, great feature.) Programmable IPG stretch. Checksum offload. Automatic padding and CRC generation. 10KB buffer! Sctter-Gather capability! Do itIn this embedded project, it was not allowed 3rd organization/person install/uninstall any package without authorization, which was guaranteed by the Trust Zone Area, it means any installed package after HASH self-signed must be verified by the public key install on this area, otherwise it will failed to get install or upgrade. What I want to said was - we trust the software installed on the board. Then it means we don’t need to consider the security issues mentioned in the 2nd article. Then we can simplify our design without considering security. Some highlight feature include: Direct linear address mapping (vir2phy, phy2vir). support more than one page size space. Zero-copy from filling the message in user space to sending message into the device in kernel space. (This GMAC support scatter-gather functionality , and the kernel later than 2.6.xx support the scatter-gather functionality) Public API to application in user space, another public API to device driver in kernel module. It provide a simple memory cache scheme in user space level, decreasing the system trap call on most circumstances. as well as it will re-fill/request to the memory pool if the threshold reached, one system call was happened only till this time. It expose more detailed real-time information in /proc file-system. Some aspects need to consider in front of project are: Memory access time is unpredictable. Memory bandwidth is limited. Data change between application is very high. Lifetime of exchanging data was short. (get/put) Linux use page table translation to get better protection, which means it was not so straightforward to access memory. Other hardware limitation, (System BUS bandwidth, MAC interface). These limitations/requirements decide the way what we do. In purpose of better memory management between kernel space and user space, we setup a raw virtual device with fixed I/O start address and length when start kernel, then both user space application which can use mmap() mapping the I/O space to its own virtual address and kernel module can access the same memory address via the fixed offset. There are some inherent access attributes on those memory, so it is necessary to have a test on which cache scheme was best suit for our requirement. For achieve the best system efficiency: Use L1-only cached memory. Zero-copy whenever possible. Minimize number of system calls and context switch. So, let’s have a look at this picture show: Design detailsEndActually, in our products, other module/process also use this POOL as hot-fast data storage, such like we develop the fsyslog which was an log framework providing the functions like syslogd(…) in Unix but it provide shared-memory based logging scheme with faster and non-blocking operation when logging in user application, etc. Later I will show the comparison after this changes, which achieving more than 30% throughput boost in whole and 2% load decrease in our specified product.","categories":[],"tags":[]},{"title":"don't use memset() init your struct","slug":"don-t-use-memset-init-your-struct","date":"2017-06-04T14:17:59.000Z","updated":"2017-06-04T15:58:53.000Z","comments":true,"path":"2017/06/04/don-t-use-memset-init-your-struct/","link":"","permalink":"https://eshenhu.github.io/2017/06/04/don-t-use-memset-init-your-struct/","excerpt":"Don’t use memset init your structEven in some open source project, we always see memset filled in the code, here I had like give the reason why we should not use memset if possible.","text":"Don’t use memset init your structEven in some open source project, we always see memset filled in the code, here I had like give the reason why we should not use memset if possible. memset was subject to give side-effect to your code.memset descriptionIn some projects, memset was used to flush the struct,like the example given here bind example given in die.net 123456789int main(int argc, char *argv[])&#123; int sfd, cfd; struct sockaddr_un my_addr, peer_addr; ... memset(&amp;my_addr, 0, sizeof(struct sockaddr_un)); /* Clear structure */ ...&#125; memset will flush with byte by byte in your raw memory. in such situations, only 0 or possible 0xFF was allowed, otherwise you will get some results more than what you expected.Some examples like this one: good example memset was not efficient than the other solution.memset will have one function call when use it.I will take this struct as example: Disassemble code on the x86-64 arch machine. how we handle this with more elegant manner?Use initlization! 1struct sockaddr_un myaddr = &#123;&#125;; Have a look at the disassemble code: Oops, it just use less code to finish this flush operation! Don’t use memset anymore!","categories":[],"tags":[{"name":"Language","slug":"Language","permalink":"https://eshenhu.github.io/tags/Language/"}]},{"title":"Hello World","slug":"hello-world","date":"2017-06-04T04:27:23.000Z","updated":"2017-06-04T04:27:23.000Z","comments":true,"path":"2017/06/04/hello-world/","link":"","permalink":"https://eshenhu.github.io/2017/06/04/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}